###################################################################

# Created by write_sdc on Sat Dec 14 19:01:38 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_model -name TSMC32K_Lowk_Conservative -library tcbn40lpbwp12ttc
set_max_transition 0.15 [current_design]
set_load -pin_load 0.1 [get_ports {pc_fetch[31]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[30]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[29]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[28]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[27]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[26]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[25]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[24]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[23]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[22]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[21]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[20]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[19]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[18]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[17]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[16]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[15]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[14]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[13]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[12]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[11]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[10]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[9]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[8]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[7]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[6]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[5]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[4]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[3]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[2]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[1]}]
set_load -pin_load 0.1 [get_ports {pc_fetch[0]}]
set_load -pin_load 0.1 [get_ports data_mem_enable]
set_load -pin_load 0.1 [get_ports {data_addr_bus[31]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[30]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[29]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[28]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[27]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[26]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[25]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[24]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[23]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[22]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[21]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[20]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[19]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[18]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[17]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[16]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[15]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[14]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[13]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[12]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[11]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[10]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[9]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[8]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[7]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[6]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[5]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[4]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[3]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[2]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[1]}]
set_load -pin_load 0.1 [get_ports {data_addr_bus[0]}]
set_load -pin_load 0.1 [get_ports {write_data[31]}]
set_load -pin_load 0.1 [get_ports {write_data[30]}]
set_load -pin_load 0.1 [get_ports {write_data[29]}]
set_load -pin_load 0.1 [get_ports {write_data[28]}]
set_load -pin_load 0.1 [get_ports {write_data[27]}]
set_load -pin_load 0.1 [get_ports {write_data[26]}]
set_load -pin_load 0.1 [get_ports {write_data[25]}]
set_load -pin_load 0.1 [get_ports {write_data[24]}]
set_load -pin_load 0.1 [get_ports {write_data[23]}]
set_load -pin_load 0.1 [get_ports {write_data[22]}]
set_load -pin_load 0.1 [get_ports {write_data[21]}]
set_load -pin_load 0.1 [get_ports {write_data[20]}]
set_load -pin_load 0.1 [get_ports {write_data[19]}]
set_load -pin_load 0.1 [get_ports {write_data[18]}]
set_load -pin_load 0.1 [get_ports {write_data[17]}]
set_load -pin_load 0.1 [get_ports {write_data[16]}]
set_load -pin_load 0.1 [get_ports {write_data[15]}]
set_load -pin_load 0.1 [get_ports {write_data[14]}]
set_load -pin_load 0.1 [get_ports {write_data[13]}]
set_load -pin_load 0.1 [get_ports {write_data[12]}]
set_load -pin_load 0.1 [get_ports {write_data[11]}]
set_load -pin_load 0.1 [get_ports {write_data[10]}]
set_load -pin_load 0.1 [get_ports {write_data[9]}]
set_load -pin_load 0.1 [get_ports {write_data[8]}]
set_load -pin_load 0.1 [get_ports {write_data[7]}]
set_load -pin_load 0.1 [get_ports {write_data[6]}]
set_load -pin_load 0.1 [get_ports {write_data[5]}]
set_load -pin_load 0.1 [get_ports {write_data[4]}]
set_load -pin_load 0.1 [get_ports {write_data[3]}]
set_load -pin_load 0.1 [get_ports {write_data[2]}]
set_load -pin_load 0.1 [get_ports {write_data[1]}]
set_load -pin_load 0.1 [get_ports {write_data[0]}]
set_load -pin_load 0.1 [get_ports data_mem_read]
set_load -pin_load 0.1 [get_ports BUSY]
set_load -pin_load 0.1 [get_ports FLUSH]
create_clock [get_ports clk]  -period 3.2  -waveform {0 1.6}
set_clock_uncertainty 0.15  [get_clocks clk]
set_input_delay -clock clk  0.4  [get_ports rst_n]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[31]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[30]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[29]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[28]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[27]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[26]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[25]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[24]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[23]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[22]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[21]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[20]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[19]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[18]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[17]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[16]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[15]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[14]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[13]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[12]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[11]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[10]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[9]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[8]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[7]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[6]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[5]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[4]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[3]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[2]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[1]}]
set_input_delay -clock clk  0.4  [get_ports {code_fetch[0]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[31]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[30]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[29]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[28]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[27]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[26]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[25]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[24]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[23]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[22]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[21]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[20]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[19]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[18]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[17]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[16]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[15]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[14]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[13]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[12]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[11]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[10]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[9]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[8]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[7]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[6]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[5]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[4]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[3]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[2]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[1]}]
set_input_delay -clock clk  0.4  [get_ports {read_data[0]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[31]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[30]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[29]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[28]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[27]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[26]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[25]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[24]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[23]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[22]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[21]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[20]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[19]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[18]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[17]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[16]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[15]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[14]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[13]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[12]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[11]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[10]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[9]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[8]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[7]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[6]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[5]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[4]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[3]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[2]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[1]}]
set_output_delay -clock clk  0.4  [get_ports {pc_fetch[0]}]
set_output_delay -clock clk  0.4  [get_ports data_mem_enable]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[31]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[30]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[29]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[28]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[27]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[26]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[25]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[24]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[23]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[22]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[21]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[20]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[19]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[18]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[17]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[16]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[15]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[14]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[13]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[12]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[11]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[10]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[9]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[8]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[7]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[6]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[5]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[4]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[3]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[2]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[1]}]
set_output_delay -clock clk  0.4  [get_ports {data_addr_bus[0]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[31]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[30]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[29]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[28]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[27]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[26]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[25]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[24]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[23]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[22]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[21]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[20]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[19]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[18]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[17]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[16]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[15]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[14]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[13]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[12]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[11]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[10]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[9]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[8]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[7]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[6]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[5]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[4]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[3]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[2]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[1]}]
set_output_delay -clock clk  0.4  [get_ports {write_data[0]}]
set_output_delay -clock clk  0.4  [get_ports data_mem_read]
set_output_delay -clock clk  0.4  [get_ports BUSY]
set_output_delay -clock clk  0.4  [get_ports FLUSH]
set_drive 0.0001  [get_ports rst_n]
